lukeSuperCoder/ai-passport/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 的所有硬件批次均使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 烧录时按实际探测容量回写镜像头。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# 像素风 UI 不要 Material 过渡:默认 theme 的白底卡片 + 80ms 插值会闪白。
CONFIG_LV_THEME_DEFAULT_TRANSITION_TIME=0
CONFIG_LV_THEME_DEFAULT_GROW=n
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 24KB 够 header + 列表 + 通知/锁屏浮层;32KB 会从系统堆再拿走 8KB,天气 DNS 容易碎掉。
CONFIG_LV_MEM_SIZE_KILOBYTES=24

# --- 系统 ---
# 100Hz 足够按键与 UI;1000Hz 空闲时白白增加 tick 中断。
CONFIG_FREERTOS_HZ=100
# 开机要在主任务里建主页并排 CJK 字形,默认 3584 会溢出导致黑屏复位。
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# 按键回调跑在 esp_timer 任务;切语言/刷中文标签需要比默认更大的栈。
CONFIG_ESP_TIMER_TASK_STACK_SIZE=8192

# --- WiFi:仅 STA,关掉 SoftAP 以节省 ESP32-C3 内部 RAM ---
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
# 默认 10/32/32 静态+动态缓冲对无 PSRAM 的 C3 过肥;STA 天气预报 + 偶发 httpd 够用。
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_RX_BA_WIN=4
CONFIG_ESP_WIFI_TX_BA_WIN=4
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=16

# --- BLE:NimBLE,多连接,作外设 + GATT 客户端(ANCS)+ walkie 扫描 ---
# Bluedroid 对无 PSRAM 的 C3 过重;扩展广播关掉省 RAM。
# Observer/Central 打开:对讲机 BLE 模式要扫描并连接另一台 Passport。
# 主机最多 9 路、控制器活动 10(含广播)。无 PSRAM 且与 Wi-Fi 共存,固件只保留 2 路同时在线。
# 典型用法:iPhone ANCS + 一台 HID/对讲。绑定槽仍为 6,没连着的设备密钥还在。
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
CONFIG_BT_NIMBLE_MAX_BONDS=6
CONFIG_BT_NIMBLE_MAX_CCCDS=12
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_EXT_ADV=n
CONFIG_BT_NIMBLE_GATT_CLIENT=y
CONFIG_BT_CTRL_BLE_MAX_ACT=5
CONFIG_BT_NIMBLE_SVC_GAP_DEVICE_NAME="Passport"
CONFIG_BT_NIMBLE_SVC_GAP_APPEARANCE=0x03C1

# 对讲机网页用 WebSocket 传 8 kHz 音频帧。
CONFIG_HTTPD_WS_SUPPORT=y
# /rtc 麦克风要安全源:自签 HTTPS 服务端。不做 TLS 客户端,关掉 CA bundle。
CONFIG_MBEDTLS_TLS_SERVER_ONLY=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=n
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_ESP_HTTPS_SERVER_ENABLE=y
# STA + httpd:80 + https:443 + walkie UDP。每个 httpd 另占 3 个内部套接字。
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_MAX_ACTIVE_TCP=12
CONFIG_LWIP_MAX_LISTENING_TCP=8
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=2880
CONFIG_LWIP_TCP_WND_DEFAULT=2880
# 天气/网页都走 IPv4;关掉 IPv6 可收回 nd6 和控制块。
CONFIG_LWIP_IPV6=n

# --- 分区:8MB Flash,factory 3MB。默认 1MB 装不下 Wi-Fi STA ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
